Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: First of all, check for trivial installation errors --- reading the section above on installing your CGI script carefully can save you a lot of time. If you wonder whether you have understood the installation procedure correctly, try installing a copy of this module file (:file:`cgi.py`) as a CGI script. When invoked as a script, the file will dump its environment and the contents of the form in HTML form. Give it the right mode etc, and send it a request. If it's installed in the standard :file:`cgi-bin` directory, it should be possible to send it a request by entering a URL into your browser of the form::
pl: Na początek, sprawdź najprostsze błędy instalacji --- czytanie powyższej sekcji o instalowaniu twojego skryptu CGI może zaoszczędzić ci wiele czasu. Jeśli zastanawiasz się czy zrozumiałeś procedurę instalacyjną prawidłowo, spróbuj zainstalować kopię pliku tego modułu (:file:`cgi.py`) jako skrypt CGI. Gdy wywołany jako skrypt, plik upuści swoje środowisko i zawartość formularza w postaci HTML. Daj mu właściwy tryb itp. i wyślij mu zapytanie. Jeśli jest zainstalowany w standardowym katalogu :file:`cgi-bin`, powinno być możliwe wysłanie zapytania przez wstawienie adresu URL do twojej przeglądarki w postaci::

source: If this gives an error of type 404, the server cannot find the script -- perhaps you need to install it in a different directory. If it gives another error, there's an installation problem that you should fix before trying to go any further. If you get a nicely formatted listing of the environment and form content (in this example, the fields should be listed as "addr" with value "At Home" and "name" with value "Joe Blow"), the :file:`cgi.py` script has been installed correctly. If you follow the same procedure for your own script, you should now be able to debug it.
pl: Jeśli zwróci błąd typu 404, wtedy serwer nie może znaleźć skryptu -- być może potrzebujesz zainstalować go w innych katalogu. Jeśli daje inny błąd, istnieje problem instalacji który powinieneś naprawić zanim spróbujesz iść dalej. Jeśli otrzymujesz ładnie sformatowany wypis środowiska i zawartości formularza (w tym przypadku, pola powinny być wypisane jako "addr" z wartością "At Home" i "name" z wartością "Joe Blow"), plik skryptu :file:`cgi.py` zostały zainstalowane poprawnie. Jeśli wykonasz tę samą procedurę dla twojego własnego skryptu, powinieneś móc go teraz odpluskwiać.

source: The next step could be to call the :mod:`cgi` module's :func:`test` function from your script: replace its main code with the single statement ::
pl: Następnym krokiem mogłoby być wezwanie zadania :func:`test` modułu :mod:`cgi` z twojego skryptu: zamiana jej głównego kodu na pojedyncze stwierdzenie::

source: This should produce the same results as those gotten from installing the :file:`cgi.py` file itself.
pl: To powinno dać te same wyniki jak te otrzymane z zainstalowania samego pliku :file:`cgi.py`.

source: When an ordinary Python script raises an unhandled exception (for whatever reason: of a typo in a module name, a file that can't be opened, etc.), the Python interpreter prints a nice traceback and exits. While the Python interpreter will still do this when your CGI script raises an exception, most likely the traceback will end up in one of the HTTP server's log files, or be discarded altogether.
pl: Gdy zwykły skrypt języka pytonowskiego zgłasza nieobsłużony wyjątek (dla jakiegokolwiek powodu: z powodu literówki w nazwie modułu, pliku który nie może być otwarty, itp.), program interpretujący polecenia języka pytonowskiego wypisuje ładny wypis i wychodzi. Podczas gdy program interpretujący polecenia języka pytonowskiego będzie wciąż to robił gdy twój skrypt CGI zgłosi wyjątek, najprawdopodobniej wypis skończy w jednym z plików logów serwera HTTP, lub zostanie odrzucony całkowicie.

source: Fortunately, once you have managed to get your script to execute *some* code, you can easily send tracebacks to the Web browser using the :mod:`cgitb` module. If you haven't done so already, just add the lines::
pl: Szczęśliwie, gdy już uda ci się wykonać *jakiś* kod za pomocą skryptu, możesz łatwo wysyłać wypisy do przeglądarki używając :mod:`cgitb`. Jeśli jeszcze nie zrobiłeś tego, po prostu dodaj linie::

source: to the top of your script. Then try running it again; when a problem occurs, you should see a detailed report that will likely make apparent the cause of the crash.
pl: na górę twojego skryptu. Wtedy spróbuj uruchomić go jeszcze raz; gdy problem pojawi się znów, powinieneś zobaczyć szczegółowy raport, który prawdopodobnie uczyni jasnym powód wypadku.

source: If you suspect that there may be a problem in importing the :mod:`cgitb` module, you can use an even more robust approach (which only uses built-in modules)::
pl: Jeśli podejrzewasz, że może być problem w importowaniu modułu :mod:`cgitb`, możesz użyć nawet jeszcze bardziej wydajnego podejścia (które używa tylko modułów wbudowanych)::

source: import sys sys.stderr = sys.stdout print("Content-Type: text/plain") print() ...your code here...
pl: import sys sys.stderr = sys.stdout print("Content-Type: text/plain") print() ...twój kod tutaj...

source: This relies on the Python interpreter to print the traceback. The content type of the output is set to plain text, which disables all HTML processing. If your script works, the raw HTML will be displayed by your client. If it raises an exception, most likely after the first two lines have been printed, a traceback will be displayed. Because no HTML interpretation is going on, the traceback will be readable.
pl: To opiera się na programie interpretującym polecenia języka pytonowskiego, że wydrukuje swój wypis. Typ treści wyjścia jest ustawiony na zwykły tekst, co wyklucza całą obsługę HTML. Jeśli twój skrypt działa, surowy HTML zostanie pokazany przez twojego klienta. Jeśli zgłasza wyjątek, najprawdopodobniej po tym jak pierwsze linie zostaną wypisane, wypis wsteczny zostanie wyświetlony. Ponieważ żadna interpretacja HTML-a nie miejsca, wypis wsteczny będzie czytelny.

source: Common problems and solutions
pl: Typowe problemy i ich rozwiązania

source: Most HTTP servers buffer the output from CGI scripts until the script is completed. This means that it is not possible to display a progress report on the client's display while the script is running.
pl: Większość serwerów HTTP przechowuje w przestrzeni wymiany wyjście ze skryptów CGI dopóki skrypt się nie zakończy. To oznacza, że nie jest możliwe wyświetlenie raportu postępu na wyświetlaczu klienta kiedy skrypt działa.

source: Check the installation instructions above.
pl: Sprawdź instrukcje instalacyjne powyżej.

source: Check the HTTP server's log files. (``tail -f logfile`` in a separate window may be useful!)
pl: Sprawdź pliki logu serwera HTTP. (``tail -f logfile`` w oddzielnym oknie może być użyteczne!)

source: Always check a script for syntax errors first, by doing something like ``python script.py``.
pl: Zawsze sprawdzaj skrypt dla błędów składniowych najpierw, przez wykonanie czegoś podobnego do ``python script.py``.

source: If your script does not have any syntax errors, try adding ``import cgitb; cgitb.enable()`` to the top of the script.
pl: Jeśli twój skrypt nie ma żadnych błędów składniowych, spróbuj dodać ``import cgitb; cgitb.enable()`` na górze skryptu.

source: When invoking external programs, make sure they can be found. Usually, this means using absolute path names --- :envvar:`PATH` is usually not set to a very useful value in a CGI script.
pl: Gdy wywoływane są zewnętrzne programy upewnij się że mogą być znalezione. Zwykle to oznacza, że używanie nazw ścieżek absolutnych --- :envvar:`PATH` nie jest zwykle ustawiana na użyteczną wartość skryptu CGI.

source: When reading or writing external files, make sure they can be read or written by the userid under which your CGI script will be running: this is typically the userid under which the web server is running, or some explicitly specified userid for a web server's ``suexec`` feature.
pl: Gdy wczytujesz lub zapisujesz zewnętrzne pliki, upewnij się że mogą one być wczytane lub zapisane przez userid pod którym twój skrypt CGI będzie działał: to jest typowo userid pod którym serwer sieci działa, lub pewny jawnie określony userid dla właściwości sieciowego serwera ``suexec``.

source: Don't try to give a CGI script a set-uid mode. This doesn't work on most systems, and is a security liability as well.
pl: Nie próbuj nadawać skryptowi CGI trybu set-uid. To nie działa na większości systemów, i jest odpowiedzialnością za bezpieczeństwo także.

source: Note that some recent versions of the HTML specification do state what order the field values should be supplied in, but knowing whether a request was received from a conforming browser, or even from a browser at all, is tedious and error-prone.
pl: Zauważ że pewne niedawne wersje specyfikacji HTML-a określają w jakiej kolejności wartości pól powinny być dostarczone, ale wiedzieć czy zapytanie zostało otrzymane z odpowiadającej przeglądarki, czy też w ogóle z przeglądarki jest nużące i podatne na błędy.

source: :mod:`cgitb` --- Traceback manager for CGI scripts
pl: :mod:`cgitb` --- zarządca wypisów śledzenia dla skryptów CGI.

source: The :mod:`cgitb` module provides a special exception handler for Python scripts. (Its name is a bit misleading. It was originally designed to display extensive traceback information in HTML for CGI scripts. It was later generalized to also display this information in plain text.) After this module is activated, if an uncaught exception occurs, a detailed, formatted report will be displayed. The report includes a traceback showing excerpts of the source code for each level, as well as the values of the arguments and local variables to currently running functions, to help you debug the problem. Optionally, you can save this information to a file instead of sending it to the browser.
pl: Moduł :mod:`cgitb` dostarcza specjalnej obsługi wyjątków dla skryptów języka pytonowskiego. (Jego nazwa jest nieco myląca. Był on oryginalnie zaprojektowany do wyświetlania szerokich informacji wypisów śledzenia w HTML-u dla skryptów CGI. To zostało później uogólnione dla wyświetlania także informacji w czystym tekście.) Po tym jak ten moduł zostanie aktywowany, jeśli niezłapany wyjątek zdarzy się, szczegółowy sformatowany raport zostanie wyświetlony. Raport zawiera wypis śledzenia pokazujący fragmenty kodu źródłowego dla każdego poziomu, zarówno jak też wartości argumentów i zmiennych lokalnych dla aktualnie uruchomionych zadań, aby pomóc odpluskwić problem. Opcjonalnie, możesz zachować tą informację w pliku zamiast wysyłać ją do przeglądarki.

source: To enable this feature, simply add this to the top of your CGI script::
pl: Aby umożliwić tą właściwość, po prostu dodaj to na górę twojego skryptu CGI::

source: The options to the :func:`enable` function control whether the report is displayed in the browser and whether the report is logged to a file for later analysis.
pl: Opcje dla zadania :func:`enable` kontrolują czy raport jest wyświetlany w przeglądarce i czy raport jest logowany do pliku dla dalszej analizy.

source: This function causes the :mod:`cgitb` module to take over the interpreter's default handling for exceptions by setting the value of :attr:`sys.excepthook`.
pl: To zadanie powoduje że moduł :mod:`cgitb` przejmuje domyślną obsługę programu interpretującego dla wyjątków przez ustawianie wartości :attr:`sys.excepthook`.

source: The optional argument *display* defaults to ``1`` and can be set to ``0`` to suppress sending the traceback to the browser. If the argument *logdir* is present, the traceback reports are written to files. The value of *logdir* should be a directory where these files will be placed. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``. If the optional argument *format* is ``"html"``, the output is formatted as HTML. Any other value forces plain text output. The default value is ``"html"``.
pl: Opcjonalny parametr *display* domyślnie równy jest ``1`` i może być ustawiony na ``0`` aby wycofać wysyłanie wypisu wstecznego dla przeglądarki. Jeśli argument *logdir* jest obecny, raporty wypisów śledzenia są zapisywane do plików. Wartość *logdir* powinna być katalogiem gdzie te pliki będą umieszczone. Opcjonalny parametr *context* jest liczbą linii kontekstu do wyświetlenia na około obecnej linii kodu źródłowego w wypisie śledzenia; to domyślnie jest ``5``. Jeśli opcjonalny parametr *format* jest ``"html"``, wyjście będzie sformatowane jako HTML. Jakiekolwiek inne wartości zmuszają do wypisu czystym tekstem. Domyślna wartość jest ``"html"``.

source: This function handles an exception using the default settings (that is, show a report in the browser, but don't log to a file). This can be used when you've caught an exception and want to report it using :mod:`cgitb`. The optional *info* argument should be a 3-tuple containing an exception type, exception value, and traceback object, exactly like the tuple returned by :func:`sys.exc_info`. If the *info* argument is not supplied, the current exception is obtained from :func:`sys.exc_info`.
pl: To zadanie obsługuje wyjątek używając domyślnych ustawień (to jest, pokazuje raport w przeglądarce, ale nie loguje do pliku). To może być użyte gdy złapiesz wyjątek i chcesz złożyć raport o tym używając :mod:`cgitb`. Opcjonalny parametr *info* powinien być 3-krotką zawierającą typ wyjątku, wartość wyjątku i przedmiot wypisu śledzenia wstecz, dokładnie jak krotka zwrócona przez :func:`sys.exc_info`. Jeśli parametr *info* nie jest dostarczony, obecny wyjątek jest otrzymywany z zadania :func:`sys.exc_info`.

source: :mod:`chunk` --- Read IFF chunked data
pl: :mod:`chunk` --- Wczytaj pokawałkowane dane IFF

source: This module provides an interface for reading files that use EA IFF 85 chunks. [#]_ This format is used in at least the Audio Interchange File Format (AIFF/AIFF-C) and the Real Media File Format (RMFF). The WAVE audio file format is closely related and can also be read using this module.
pl: Ten moduł dostarcza sprzęg dla wczytania pliku który używa kawałków EA IFF 85. [#]_ Ten format jest używany co najmniej w AIFF - Formacie Pliku Wymiany Dźwięku (AIFF/AIFF-C) i Formacie Pliku Real Media (RMFF). Format pliku dźwiękowego WAVE jest blisko związany i może także być wczytany używając tego modułu.

source: A chunk has the following structure:
pl: Kawałek ma następującą strukturę:

source: Length
pl: Długość

source: Contents
pl: Zawartość

source: Chunk ID
pl: ID kawałka

source: Size of chunk in big-endian byte order, not including the header
pl: Rozmiar kawałka w porządku bajtów dużego-endian-u , nie zawierając nagłówka.

source: Data bytes, where *n* is the size given in the preceding field
pl: Bajty danych, gdzie *n* jest rozmiarem danym w poprzednim polu

source: 0 or 1
pl: 0 lub 1

source: Pad byte needed if *n* is odd and chunk alignment is used
pl: Bajt wyrównania potrzebny jeśli *n* jest nieparzysty i wyrównanie kawałka jest używane.

source: The ID is a 4-byte string which identifies the type of chunk.
pl: Identyfikator ID jest 4-bajtowym ciągiem znaków który identyfikuje typ kawałka.

source: The size field (a 32-bit value, encoded using big-endian byte order) gives the size of the chunk data, not including the 8-byte header.
pl: Pole rozmiaru (32-bitowa wartość, zakodowana używając porządku bajtów dużego-endian-a) daje rozmiar danych kawałka, nie zawierając 8-bajtowego nagłówka.

source: Usually an IFF-type file consists of one or more chunks. The proposed usage of the :class:`Chunk` class defined here is to instantiate an instance at the start of each chunk and read from the instance until it reaches the end, after which a new instance can be instantiated. At the end of the file, creating a new instance will fail with a :exc:`EOFError` exception.
pl: Zwykle typ pliku-IFF składa się z jednego lub więcej kawałków. Proponowane użycie uogólnienia :class:`Chunk` określonego tutaj jest daniem przykładu na początku każdego kawałka i wczytanie z tego przykładu zanim dotrze on do końca, po którym nowy przykład może być dany. Na końcu pliku, utworzenie nowego przykładu zawiedzie z wyjątkiem :exc:`EOFError`.

source: Class which represents a chunk. The *file* argument is expected to be a file-like object. An instance of this class is specifically allowed. The only method that is needed is :meth:`read`. If the methods :meth:`seek` and :meth:`tell` are present and don't raise an exception, they are also used. If these methods are present and raise an exception, they are expected to not have altered the object. If the optional argument *align* is true, chunks are assumed to be aligned on 2-byte boundaries. If *align* is false, no alignment is assumed. The default value is true. If the optional argument *bigendian* is false, the chunk size is assumed to be in little-endian order. This is needed for WAVE audio files. The default value is true. If the optional argument *inclheader* is true, the size given in the chunk header includes the size of the header. The default value is false.
pl: Uogólnienie, które reprezentuje kawałek. Parametr *pliku* jest oczekiwany że będzie podobnym do pliku przedmiotem. Przykład tego uogólnienia jest szczególnie dozwolony. Jedyny sposób postępowania który jest wymagany jest :meth:`read`. Jeśli sposoby postępowania :meth:`seek` i :meth:`tell` są obecne i nie zwracają wyjątku, także są używane. Jeśli te sposoby postępowania są obecne i zgłaszają wyjątek, jest oczekiwane że nie zmienią przedmiotu. Jeśli opcjonalny parametr *align* jest prawdziwy, kawałki zakłada się że są ułożone na 2-bajtowych brzegach. Jeśli *align* jest fałszywy, żadne ułożenie nie jest przyjmowane. Domyślną wartością jest prawda. Jeśli opcjonalny parametr *bigendian* jest fałszywy rozmiar kawałka jest zakładany że jest w porządku małego-endian-a. To jest wymagane dla plików dźwiękowych WAVE. Domyślna wartość jest prawdziwa. Jeśli opcjonalny parametr *inclheader* jest prawdziwy, rozmiar dany w nagłówku kawałka zawiera rozmiar nagłówka, domyślną wartością jest fałsz.

source: A :class:`Chunk` object supports the following methods:
pl: przedmiot uogólnienia :class:`Chunk` wspiera następujące sposoby postępowania:

source: Returns the name (ID) of the chunk. This is the first 4 bytes of the chunk.
pl: Zwraca nazwę (IDentyfikator) kawałka. To jest pierwsze 4 bajty kawałka.

source: Returns the size of the chunk.
pl: Zwraca rozmiar kawałka.

source: Close and skip to the end of the chunk. This does not close the underlying file.
pl: Zamknij i przeskocz na koniec kawałka. To nie zamyka leżącego u podstaw pliku.

source: The remaining methods will raise :exc:`IOError` if called after the :meth:`close` method has been called.
pl: Pozostałe sposoby postępowania zgłoszą :exc:`IOError` jeśli wywołany po tym, jak sposób postępowania :meth:`close` został wywołany.

source: Returns ``False``.
pl: Zwraca ``fałsz``.

source: Set the chunk's current position. The *whence* argument is optional and defaults to ``0`` (absolute file positioning); other values are ``1`` (seek relative to the current position) and ``2`` (seek relative to the file's end). There is no return value. If the underlying file does not allow seek, only forward seeks are allowed.
pl: Ustaw obecną pozycję kawałka. Parametr *whence* jest opcjonalny i domyślnie równy ``0`` (bezwzględna pozycja w pliku); inne wartości są ``1`` (wyszukaj w odniesieniu do obecnej pozycji w pliku) i ``2`` (wyszukaj w odniesieniu do końca pliku). Nie ma wartości zwracanej. Jeśli leżący u podstaw plik nie pozwala na wyszukiwanie, tylko wyszukiwanie w przód jest dozwolone.

source: Return the current position into the chunk.
pl: Zwróć obecną pozycję w kawałku.

source: Read at most *size* bytes from the chunk (less if the read hits the end of the chunk before obtaining *size* bytes). If the *size* argument is negative or omitted, read all data until the end of the chunk. The bytes are returned as a string object. An empty string is returned when the end of the chunk is encountered immediately.
pl: Zwróć co najwyżej *size* bajtów z kawałka (mniej jeśli wczytywanie napotka koniec kawałka przed otrzymaniem *size* bajtów). Jeśli parametr *size* jest ujemny lub pominięty, wczytaj wszystkie dane aż do końca kawałka. Bajty są zwracane jako przedmiot ciągu znaków. Pusty ciąg znaków jest zwracany gdy koniec kawałka jest napotykany natychmiast.

source: Skip to the end of the chunk. All further calls to :meth:`read` for the chunk will return ``''``. If you are not interested in the contents of the chunk, this method should be called so that the file points to the start of the next chunk.
pl: Przeskocz do końca kawałka. Wszystkie przyszłe wywołania sposobu postępowania :meth:`read` dla kawałka zwrócą ``"``. Jeśli nie jesteś zainteresowany zawartością kawałka, ten sposób postępowania powinien być wywoływany tak aby plik wskazywał początek następnego kawałka.

source: "EA IFF 85" Standard for Interchange Format Files, Jerry Morrison, Electronic Arts, January 1985.
pl: "EA IFF 85" Standard dla formatu plików wzajemnej wymiany, Jerry Morrison, Electronic Arts, styczeń 1985.

source: :mod:`cmath` --- Mathematical functions for complex numbers
pl: :mod:`cmath` --- zadania matematyczne dla liczb zespolonych

source: This module is always available. It provides access to mathematical functions for complex numbers. The functions in this module accept integers, floating-point numbers or complex numbers as arguments. They will also accept any Python object that has either a :meth:`__complex__` or a :meth:`__float__` method: these methods are used to convert the object to a complex or floating-point number, respectively, and the function is then applied to the result of the conversion.
pl: Ten moduł jest zawsze dostępny. Dostarcza on dostęp do zadań matematycznych dla liczb zespolonych. Zadania w tym module akceptują liczby całkowite, liczby zmiennoprzecinkowe lub liczby zespolone jako parametry. Będą one także akceptować dowolne przedmioty języka pytonowskiego które mają sposoby postępowania albo :meth:`__complex__` lub :meth:`__float__`: te sposoby postępowania są używane aby zamienić przedmiot na liczbę zespoloną lub zmiennoprzecinkową, odpowiednio, i zadanie jest wtedy stosowane dla rezultatu przekształcenia

source: On platforms with hardware and system-level support for signed zeros, functions involving branch cuts are continuous on *both* sides of the branch cut: the sign of the zero distinguishes one side of the branch cut from the other. On platforms that do not support signed zeros the continuity is as specified below.
pl: Na maszynach/środowiskach ze wsparciem sprzętowym lub poziomu-systemu dla oznaczonych zer, zadania biorące pod uwagę cięcia rozgałęzień są ciągłe po obu stronach cięcia odgałęzienia: znak zera rozróżnia jedną stronę cięcia odgałęzienia od drugiej. Na maszynach/środowiskach, które nie wspierają znaczonych zer ciągłość jest określona poniżej.

source: Conversions to and from polar coordinates
pl: Zamiany z i do współrzędnych polowych.

source: A Python complex number ``z`` is stored internally using *rectangular* or *Cartesian* coordinates. It is completely determined by its *real part* ``z.real`` and its *imaginary part* ``z.imag``. In other words::
pl: Liczba zespolona ``z`` jest zachowana wewnętrznie używając współrzędnych *prostokątnych* lub *Kartezjańskich*. Jest to kompletnie zdeterminowane przez *część rzeczywistą* - ``z.real`` i *część urojoną* ``z.imag``. Innymi słowy::
